FirmwareWang/MineSweeper_LPC54608/MineSweeper_LPC54608/board/pin_mux.c
  const uint32_t port3_pin0_config =
      (/* Pin is configured as LCD_VD(14) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT3 PIN0 (coords: D12) is configured as LCD_VD(14) */
  IOCON_PinMuxSet(IOCON, 3U, 0U, port3_pin0_config);

  const uint32_t port3_pin1_config =
      (/* Pin is configured as LCD_VD(15) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT3 PIN1 (coords: D11) is configured as LCD_VD(15) */
  IOCON_PinMuxSet(IOCON, 3U, 1U, port3_pin1_config);

  const uint32_t port3_pin5_config =
      (/* Pin is configured as LCD_VD(19) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT3 PIN5 (coords: B10) is configured as LCD_VD(19) */
  IOCON_PinMuxSet(IOCON, 3U, 5U, port3_pin5_config);

  const uint32_t port3_pin6_config =
      (/* Pin is configured as LCD_VD(20) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT3 PIN6 (coords: C9) is configured as LCD_VD(20) */
  IOCON_PinMuxSet(IOCON, 3U, 6U, port3_pin6_config);

  const uint32_t port3_pin7_config =
      (/* Pin is configured as LCD_VD(21) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT3 PIN7 (coords: B8) is configured as LCD_VD(21) */
  IOCON_PinMuxSet(IOCON, 3U, 7U, port3_pin7_config);

  const uint32_t port3_pin8_config =
      (/* Pin is configured as LCD_VD(22) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT3 PIN8 (coords: A7) is configured as LCD_VD(22) */
  IOCON_PinMuxSet(IOCON, 3U, 8U, port3_pin8_config);

  const uint32_t port3_pin9_config =
      (/* Pin is configured as LCD_VD(23) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT3 PIN9 (coords: C7) is configured as LCD_VD(23) */
  IOCON_PinMuxSet(IOCON, 3U, 9U, port3_pin9_config);

  const uint32_t port3_pin23_config =
      (/* Pin is configured as FC2_CTS_SDA_SSEL0 */
       IOCON_PIO_FUNC1 |
       /* I2C mode */
       IOCON_PIO_I2CSLEW_I2C |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* High drive: 20 mA */
       IOCON_PIO_I2CDRIVE_HIGH |
       /* I2C 50 ns glitch filter enabled */
       IOCON_PIO_I2CFILTER_EN);
  /* PORT3 PIN23 (coords: C2) is configured as FC2_CTS_SDA_SSEL0 */
  IOCON_PinMuxSet(IOCON, 3U, 23U, port3_pin23_config);

  const uint32_t port3_pin24_config =
      (/* Pin is configured as FC2_RTS_SCL_SSEL1 */
       IOCON_PIO_FUNC1 |
       /* I2C mode */
       IOCON_PIO_I2CSLEW_I2C |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* High drive: 20 mA */
       IOCON_PIO_I2CDRIVE_HIGH |
       /* I2C 50 ns glitch filter enabled */
       IOCON_PIO_I2CFILTER_EN);
  /* PORT3 PIN24 (coords: E2) is configured as FC2_RTS_SCL_SSEL1 */
  IOCON_PinMuxSet(IOCON, 3U, 24U, port3_pin24_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
